mod_ui_12 <- function(id) {
  ns <- NS(id)  # 创建命名空间
  tagList(
    sidebarLayout(
      sidebarPanel(
        h4(tags$b("输入数据")),
        textInput(ns("data0"), "请输入未患病群体的数据 (使用逗号分隔):", value = "136,286,281,23,200,146,220,96,100,60,17,27,126,100,253,70,40,6,46"),
        textInput(ns("data1"), "请输入患病群体的数据 (使用逗号分隔):", value = "140,1087,230,183,1256,700,16,800,253,740,126,153,283,90,303,193,76,1370,543,913,230,463,60,509,576,671,80,490,156,356,350,323,1560,120,216,443,523,76,303,353,206"),
        actionButton(ns("submit"), "计算")
      ),
      mainPanel(
        h4("结果"),
        plotOutput(ns("roc_plot"))
      )
    )
  )
}
